In [5]:
import numpy as np
import pandas as pd

In [2]:
data = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'MANUAL', 'sedan', 2000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'AUTOMATIC', 'Sedan', 27150],
    ['Lotus', 'Elise', 2010, 218, 4, 'MANUAL', 'convertible', 54990],
    ['GMC', 'Acadia',  2017, 194, 4, 'AUTOMATIC', '4dr SUV', 34450],
    ['Nissan', 'Frontier', 2017, 261, 6, 'MANUAL', 'Pickup', 32340],
]

columns = [
    'Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
    'Transmission Type', 'Vehicle_Style', 'MSRP'
]

In [6]:
df = pd.DataFrame(data, columns=columns)
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [7]:
df.Make

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object

In [8]:
df['Model']

0      Stanza
1      Sonata
2       Elise
3      Acadia
4    Frontier
Name: Model, dtype: object

In [14]:
df[['Make', 'MSRP']]

      Make   MSRP
0   Nissan   2000
1  Hyundai  27150
2    Lotus  54990
3      GMC  34450
4   Nissan  32340

In [15]:
df['newCol'] = [2, 3, 4, 5, 6]
df.head()

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,Id,newCol
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,2,2
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,3,3
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,4,4
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,5,5
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,6,6

In [16]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [17]:
df.Year.index

RangeIndex(start=0, stop=5, step=1)

In [18]:
df.loc[1]

Make                   Hyundai
Model                   Sonata
Year                      2017
Engine HP                  NaN
Engine Cylinders             4
Transmission Type    AUTOMATIC
Vehicle_Style            Sedan
MSRP                     27150
Id                           3
newCol                       3
Name: 1, dtype: object

In [19]:
df.loc[[1, 2]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,Id,newCol
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,3,3
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,4,4

In [21]:
df.index = ['a', 'b', 'c', 'd', 'e']
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [22]:
df.iloc[[1, 2]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,Id,newCol
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,3,3
c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,4,4

In [23]:
df.loc[['b', 'c']]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,Id,newCol
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,3,3
c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,4,4

Element-wise operations

In [26]:
df['Year'] * 2 # same as in numpy arrays, though this is not numpy array but pandas.core.series.Series
#type(df['Year'])

a    3982
b    4034
c    4020
d    4034
e    4034
Name: Year, dtype: int64

In [27]:
df['Year'] > 2015

a    False
b     True
c    False
d     True
e     True
Name: Year, dtype: bool

In [28]:
df[df['Year'] > 2015]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,Id,newCol
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,3,3
d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,5,5
e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,6,6

String operations

In [29]:
'STR'.lower()

'str'

In [30]:
df['Transmission Type'].str.lower()

a       manual
b    automatic
c       manual
d    automatic
e       manual
Name: Transmission Type, dtype: object

Aggregation operators

In [31]:
df.MSRP.mean()

30186.0

In [32]:
df.describe()

,Year,Engine HP,Engine Cylinders,MSRP,Id,newCol
count,5.000000,4.00000,5.000000,5.000000,5.000000,5.000000
mean,2010.400000,202.75000,4.400000,30186.000000,4.000000,4.000000
std,11.260551,51.29896,0.894427,18985.044904,1.581139,1.581139
min,1991.000000,138.00000,4.000000,2000.000000,2.000000,2.000000
25%,2010.000000,180.00000,4.000000,27150.000000,3.000000,3.000000
50%,2017.000000,206.00000,4.000000,32340.000000,4.000000,4.000000
75%,2017.000000,228.75000,4.000000,34450.000000,5.000000,5.000000
max,2017.000000,261.00000,6.000000,54990.000000,6.000000,6.000000

In [33]:
df.MSRP.describe()

count        5.000000
mean     30186.000000
std      18985.044904
min       2000.000000
25%      27150.000000
50%      32340.000000
75%      34450.000000
max      54990.000000
Name: MSRP, dtype: float64

In [36]:
df.nunique()

Make                 4
Model                5
Year                 3
Engine HP            4
Engine Cylinders     2
Transmission Type    2
Vehicle_Style        5
MSRP                 5
Id                   5
newCol               5
dtype: int64

In [38]:
df.isnull().sum()

Make                 0
Model                0
Year                 0
Engine HP            1
Engine Cylinders     0
Transmission Type    0
Vehicle_Style        0
MSRP                 0
Id                   0
newCol               0
dtype: int64

In [39]:
df.groupby('Transmission Type').MSRP.mean()

Transmission Type
AUTOMATIC    30800.000000
MANUAL       29776.666667
Name: MSRP, dtype: float64

In [40]:
df.MSRP.values # returns series underlying numpy array

array([ 2000, 27150, 54990, 34450, 32340], dtype=int64)